import './App.css';
import ControlledForms from "./components/forms/ControlledForms";

function App() {
  return (
    <div>
        <ControlledForms/>
    </div>
  );
}

export default App;


// сверху страницы у вас должна быть форма для записи/редактирования машин
// под формой должны выводится машинки
// у каждой машинки должно быть 2 кнопки delete и edit:
//     - по нажатии на кнопку delete машина должна удалятся с базы данных и со списка выведенных машин
// - по нажатии на кнопку edit, форма должна заполнится данными выбранной машины с последующим обновлением и сохранением в базу данных
